app/controllers/friendships_controller.rb

  def create
    sleep(2)
    Friendship.create!(out_friend_id: params[:id],
      in_friend_id: current_user.id )
---
INSERT INTO "friendships" ("created_at", "in_friend_id", "out_friend_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Fri, 07 Feb 2014 14:43:18 UTC +00:00], ["in_friend_id", 2], ["out_friend_id", 1], ["updated_at", Fri, 07 Feb 2014 14:43:18 UTC +00:00]]

  def destroy
    sleep(2)
    @friendship = Friendship.find_by_out_friend_id_and_in_friend_id(params[:id], current_user.id)

    @friendship.destroy
---
SELECT "friendships".* FROM "friendships" WHERE "friendships"."out_friend_id" = 1 AND "friendships"."in_friend_id" = 2 LIMIT 1
DELETE FROM "friendships" WHERE "friendships"."id" = $1  [["id", 7]]