app/controllers/secrets_controller.rb

  def create
    @secret = Secret.new(params[:secret])
    @secret.author_id = current_user.id

    if @secret.save
---
INSERT INTO "secrets" ("author_id", "created_at", "recipient_id", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_id", 2], ["created_at", Fri, 07 Feb 2014 14:17:39 UTC +00:00], ["recipient_id", 1], ["title", "Hi"], ["updated_at", Fri, 07 Feb 2014 14:17:39 UTC +00:00]]