app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "password_digest", "session_token", "updated_at", "username") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new(params[:user])

    if @user.save

SELECT "tags".* FROM "tags"
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @tags = Tag.all

    if params.include?(:id)
      @user = User.find(params[:id])

SELECT "users".* FROM "users"
---
  def index
    @users = User.all